kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxc/PIC32MX250F128C.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMP</name>
      <description>PMP peripheral</description>
      <baseAddress>0xbf807000</baseAddress>
      <registers>
        <register>
          <name>PMCON</name>
          <description>PMCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDSP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRSP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1P</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ALP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSF</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PTRDEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PTWREN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PMPTTL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADRMUX</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCONCLR</name>
          <description>PMCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDSP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRSP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1P</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ALP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSF</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PTRDEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PTWREN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PMPTTL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADRMUX</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCONSET</name>
          <description>PMCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDSP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRSP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1P</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ALP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSF</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PTRDEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PTWREN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PMPTTL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADRMUX</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCONINV</name>
          <description>PMCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDSP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRSP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1P</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ALP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSF</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PTRDEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PTWREN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PMPTTL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADRMUX</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMODE</name>
          <description>PMMODE register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WAITE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>WAITM</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>WAITB</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INCM</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>IRQM</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMODECLR</name>
          <description>PMMODECLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WAITE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>WAITM</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>WAITB</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INCM</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>IRQM</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMODESET</name>
          <description>PMMODESET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WAITE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>WAITM</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>WAITB</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INCM</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>IRQM</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMODEINV</name>
          <description>PMMODEINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WAITE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>WAITM</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>WAITB</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INCM</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>IRQM</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMADDR</name>
          <description>PMADDR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>CS</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMADDRCLR</name>
          <description>PMADDRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>CS</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMADDRSET</name>
          <description>PMADDRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>CS</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMADDRINV</name>
          <description>PMADDRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>CS</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDOUT</name>
          <description>PMDOUT register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAOUT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDOUTCLR</name>
          <description>PMDOUTCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAOUT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDOUTSET</name>
          <description>PMDOUTSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAOUT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDOUTINV</name>
          <description>PMDOUTINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAOUT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDIN</name>
          <description>PMDIN register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDINCLR</name>
          <description>PMDINCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDINSET</name>
          <description>PMDINSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDININV</name>
          <description>PMDININV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAEN</name>
          <description>PMAEN register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PTEN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAENCLR</name>
          <description>PMAENCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PTEN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAENSET</name>
          <description>PMAENSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PTEN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAENINV</name>
          <description>PMAENINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PTEN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSTAT</name>
          <description>PMSTAT register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>143</resetValue>
          <fields>
            <field>
              <name>OB0E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OB1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OB2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OB3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OBUF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OBE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IB0F</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IB1F</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IB2F</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IB3F</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IBOV</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IBF</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSTATCLR</name>
          <description>PMSTATCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OB0E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OB1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OB2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OB3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OBUF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OBE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IB0F</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IB1F</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IB2F</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IB3F</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IBOV</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IBF</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSTATSET</name>
          <description>PMSTATSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OB0E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OB1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OB2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OB3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OBUF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OBE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IB0F</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IB1F</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IB2F</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IB3F</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IBOV</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IBF</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
