kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxc/PIC32MX250F128C.svd
        <register>
          <name>PMSTATINV</name>
          <description>PMSTATINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OB0E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OB1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OB2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OB3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OBUF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OBE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IB0F</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IB1F</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IB2F</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IB3F</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IBOV</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IBF</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC10</name>
      <description>ADC10 peripheral</description>
      <baseAddress>0xbf809000</baseAddress>
      <registers>
        <register>
          <name>AD1CON1</name>
          <description>AD1CON1 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1CLR</name>
          <description>AD1CON1CLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1SET</name>
          <description>AD1CON1SET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1INV</name>
          <description>AD1CON1INV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2</name>
          <description>AD1CON2 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2CLR</name>
          <description>AD1CON2CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2SET</name>
          <description>AD1CON2SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2INV</name>
          <description>AD1CON2INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3</name>
          <description>AD1CON3 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3CLR</name>
          <description>AD1CON3CLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3SET</name>
          <description>AD1CON3SET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3INV</name>
          <description>AD1CON3INV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHS</name>
          <description>AD1CHS register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHSCLR</name>
          <description>AD1CHSCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHSSET</name>
          <description>AD1CHSSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHSINV</name>
          <description>AD1CHSINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSL</name>
          <description>AD1CSSL register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSLCLR</name>
          <description>AD1CSSLCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSLSET</name>
          <description>AD1CSSLSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSLINV</name>
          <description>AD1CSSLINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF0</name>
          <description>ADC1BUF0 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF1</name>
          <description>ADC1BUF1 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF2</name>
          <description>ADC1BUF2 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF3</name>
          <description>ADC1BUF3 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF4</name>
          <description>ADC1BUF4 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF4</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF5</name>
          <description>ADC1BUF5 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF5</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF6</name>
          <description>ADC1BUF6 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF7</name>
          <description>ADC1BUF7 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF7</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF8</name>
          <description>ADC1BUF8 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF9</name>
          <description>ADC1BUF9 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF9</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFA</name>
          <description>ADC1BUFA register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFB</name>
          <description>ADC1BUFB register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFC</name>
          <description>ADC1BUFC register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFC</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFD</name>
          <description>ADC1BUFD register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFD</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
