kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxc/PIC32MX250F128C.svd
        <register>
          <name>IEC1SET</name>
          <description>IEC1SET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CTMUIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1INV</name>
          <description>IEC1INV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CTMUIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0</name>
          <description>IPC0 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0CLR</name>
          <description>IPC0CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0SET</name>
          <description>IPC0SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0INV</name>
          <description>IPC0INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1</name>
          <description>IPC1 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1CLR</name>
          <description>IPC1CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1SET</name>
          <description>IPC1SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1INV</name>
          <description>IPC1INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2</name>
          <description>IPC2 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2CLR</name>
          <description>IPC2CLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2SET</name>
          <description>IPC2SET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2INV</name>
          <description>IPC2INV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3</name>
          <description>IPC3 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
