kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxc/PIC32MX250F128C.svd
        <register>
          <name>IPC3CLR</name>
          <description>IPC3CLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3SET</name>
          <description>IPC3SET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3INV</name>
          <description>IPC3INV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4</name>
          <description>IPC4 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4CLR</name>
          <description>IPC4CLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4SET</name>
          <description>IPC4SET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4INV</name>
          <description>IPC4INV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5</name>
          <description>IPC5 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>AD1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>AD1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5CLR</name>
          <description>IPC5CLR register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>AD1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>AD1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5SET</name>
          <description>IPC5SET register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>AD1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>AD1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5INV</name>
          <description>IPC5INV register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>AD1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>AD1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6</name>
          <description>IPC6 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6CLR</name>
          <description>IPC6CLR register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6SET</name>
          <description>IPC6SET register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6INV</name>
          <description>IPC6INV register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7</name>
          <description>IPC7 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7CLR</name>
          <description>IPC7CLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7SET</name>
          <description>IPC7SET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7INV</name>
          <description>IPC7INV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
