kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxc/PIC32MX250F128C.svd
        <register>
          <name>CNPDBSET</name>
          <description>CNPDBSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBINV</name>
          <description>CNPDBINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONB</name>
          <description>CNCONB register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBCLR</name>
          <description>CNCONBCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBSET</name>
          <description>CNCONBSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBINV</name>
          <description>CNCONBINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENB</name>
          <description>CNENB register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENBCLR</name>
          <description>CNENBCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENBSET</name>
          <description>CNENBSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENBINV</name>
          <description>CNENBINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATB</name>
          <description>CNSTATB register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBCLR</name>
          <description>CNSTATBCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBSET</name>
          <description>CNSTATBSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBINV</name>
          <description>CNSTATBINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
